app/controllers/api/v1/lunches_controller.rb

UPDATE "lunches" SET "distance" = $1, "updated_at" = $2 WHERE "lunches"."id" = $3  [["distance", "50"], ["updated_at", "2021-02-25 17:18:11.071801"], ["id", 1]]
---
      def update
        if @lunch.update(lunch_params)

INSERT INTO "lunches" ("localisation", "distance", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["localisation", "Saint Gilles"], ["distance", "36000"], ["price", "{1,4}"], ["user_id", 1], ["created_at", "2021-02-26 12:42:10.374453"], ["updated_at", "2021-02-26 12:42:10.374453"]]
---
      def create
        #  act as a constructor
        @hash_params = {
          localisation: lunch_params['localisation'],
          distance: lunch_params['distance'],
          price: lunch_params['price'],
          taste: nil
        }
        # binding.pry
        # create a range for price api
        price_min = lunch_params['price'].min
        price_max = lunch_params['price'].max
        @hash_params[:price] = [*price_min..price_max].join(',')

        # Calling method to sort and fetch the api
        matching_preferences
        choice_count

        # Creating object lunch
        @lunch = Lunch.new(
          localisation: lunch_params['localisation'],
          distance: lunch_params['distance'],
          price: lunch_params['price']
        )

        # for pundit
        @lunch.user = current_user
        authorize @lunch
        if @lunch.save

DELETE FROM "lunches" WHERE "lunches"."id" = $1  [["id", 1]]
---
      def destroy
        @lunch.destroy

SELECT "lunches".* FROM "lunches" WHERE "lunches"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
      def set_lunch
        @lunch = Lunch.find(params[:id])

SELECT "preferences".* FROM "preferences" WHERE "preferences"."name" = $1  [["name", "Pierre"]]
---
def matching_preferences
  # create an hash with the tastes preferences of everyone
  i = 0
  j = lunch_params['attendees'].count
  @preferences = []
  while i < j

    # find the name in the params for i
    name = lunch_params['attendees'][i]
    # find the name of the user in preference for i
    tmp = Preference.where(name: name)[0][:taste]
    # creating a temporary varaible to create an array to sock the preferences
    tmp.each { |string| @preferences.append(string) }

INSERT INTO "restaurants" ("restaurant_name", "restaurant_price", "restaurant_city", "restaurant_category", "restaurant_distance", "lunch_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
def upper_limit
  # call the api and fetch de data into @body
  fetch_yelp(
    @hash_params[:localisation],
    @hash_params[:distance],
    @hash_params[:price],
    @hash_params[:taste]
  )

  # validation if empty of nil to avoid to crash the api
  if @body.nil? || @body['businesses'].count.zero?
    empty_request # call emtpy request method in parent
  else
    # selecting a maximum of 10 movies or less
    @body['businesses'].count < 10 ? (upper_limit = @body['businesses'].count) : (upper_limit = 10)
    i = 0
    # while i < 10
    while i < upper_limit
      # binding.pry
      restaurant = Restaurant.new({
                                    'lunch_id' => @lunch.id,
                                    'restaurant_name' => @body['businesses'][i]['name'],
                                    'restaurant_price' => @body['businesses'][i]['price'],
                                    'restaurant_city' => @body['businesses'][i]['location']['city'],
                                    'restaurant_category' => @body['businesses'][i]['categories'][0]['alias'],
                                    'restaurant_distance' => @body['businesses'][i]['distance'].round
                                  })
      restaurant.save