app/controllers/api/v1/lunches_controller.rb

INSERT INTO "lunches" ("localisation", "distance", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["localisation", "Arlon"], ["distance", "50"], ["price", "{2,3}"], ["user_id", 1], ["created_at", "2021-02-24 10:41:16.364304"], ["updated_at", "2021-02-24 10:41:16.364304"]]
---

    @lunch.user = current_user
    authorize @lunch
    if @lunch.save

SELECT "preferences".* FROM "preferences" WHERE "preferences"."name" = $1  [["name", "Pierre"]]
---
  def matching_preferences
    i = 0
    j = lunch_params['attendees'].count
    @preferences = []
    while i < j

      # find the name in the params for i
      name = lunch_params['attendees'][i]
      # find the name of the user in preference for i
      tmp = Preference.where(name: name)[0][:taste]