app/controllers/api/v1/lunches_controller.rb

def upper_limit
    # validation if empty of nil to avoid to crash the api
    if @body.nil? || @body['businesses'].count.zero?
      empty_request # call emtpy request method in parent
    else
      # selecting a maximum of 10 movies or less
      @body['businesses'].count < 10 ? (upper_limit = @body['businesses'].count) : (upper_limit = 10)
      i = 0
      # while i < 10
      while i < upper_limit

        restaurant = Restaurant.new({
            'lunch_id' => @lunch.id,
            'restaurant_name' => @body['businesses'][i]['name'],
            'restaurant_price' => @body['businesses'][i]['price'],
            'restaurant_city' => @body['businesses'][i]['location']['city'],
            'restaurant_category' => @body['businesses'][i]['categories'][0]['alias']
            })
        restaurant.save
---
INSERT INTO "restaurants" ("restaurant_name", "restaurant_price", "restaurant_city", "restaurant_category", "lunch_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"