app/controllers/api/v1/preferences_controller.rb

INSERT INTO "preferences" ("name", "taste", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "999"], ["taste", "{Italian,Lebanese,Japanese,Belgian}"], ["user_id", 1], ["created_at", "2021-02-27 15:52:07.886533"], ["updated_at", "2021-02-27 15:52:07.886533"]]
---
      def create
        @preference = Preference.new(preference_params)
        @preference.user = current_user
        authorize @preference
        if @preference.save

SELECT "preferences".* FROM "preferences" WHERE "preferences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_preference
        # @preference = preference.where(name: params[:id])
        @preference = Preference.find(params[:id])